### 01 Import libraries

In [1]:
#import libaries
import pandas as pd
import numpy as np
import os

In [6]:
path = r'/Users/emilypickett/Documents/InstaCart Basket Project'

In [7]:
#import products.csv
df_prods = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'products.csv'), index_col = False)

In [38]:
#import wrangled orders
df_ords = pd.read_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# 02 Mixed-Type Data

In [10]:
#Create a dataframe
df_test = pd.DataFrame()

In [12]:
#Create a mixed type coulmn
df_test ['mix'] = ['a', 'b', 1, True]

In [13]:
df_test

    mix
0     a
1     b
2     1
3  True

In [40]:
#checking for mixed data
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

/var/folders/zk/lxc3sp7n5rqf4k_sl172k5xh0000gn/T/ipykernel_43896/3840032589.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [18]:
#convert mixed data into string data
df_test['mix'] = df_test['mix'].astype('str')

# 03 Missing Data

In [20]:
#counting missing data
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [22]:
#creating dataframe of only the 16 missing values
df_nan = df_prods[df_prods['product_name'].isnull()== True]

In [23]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [25]:
#total number of rows and coulmns 
df_prods.shape

(49693, 5)

In [26]:
#dataframe with no missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull()== False]

In [27]:
#total number of rows and columns without the missing values
df_prods_clean.shape

(49677, 5)

In [28]:
#drop all missing vaules
df_prods.dropna(inplace = True)

In [30]:
#overwritting all NaNs from df_prods dataframe
df_prods.dropna(subset = ['product_name'], inplace = True)

# 04 Duplicates

In [31]:
#finding for full duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [32]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [33]:
df_prods_clean.shape

(49677, 5)

In [34]:
#create new dataframe with no duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [35]:
df_prods_clean_no_dups.shape

(49672, 5)

In [36]:
#export data
df_prods_clean_no_dups.to_csv(os.path.join(path,'Data','Prepared Data','products_checks.csv'))

### Task 4.5 Answers

In [39]:
#2 
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

2a Answer
days_since_prior_order column looks off. The min and max are 0-3 while the 25% , 50% quartiles, and std are above the max at 7. 

order_hour_of day column has this problem as well. The std higher at 4 while the max is only 2.3.

order_number column has the same problem. the max is 1 while the 75% and 25% quartiles, and std are higher at 2.3,5, 5.9

In [47]:
#3 checking for mixed data
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

/var/folders/zk/lxc3sp7n5rqf4k_sl172k5xh0000gn/T/ipykernel_43896/452425755.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/zk/lxc3sp7n5rqf4k_sl172k5xh0000gn/T/ipykernel_43896/452425755.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/zk/lxc3sp7n5rqf4k_sl172k5xh0000gn/T/ipykernel_43896/452425755.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/zk/lxc3sp7n5rqf4k_sl172k5xh0000gn/T/ipykernel_43896/452425755.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/zk/lxc3sp7n5rqf4k_sl172k5xh0000gn/T/ipykernel_43896/452425755.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/zk/lxc3sp7n5rqf4k_sl172k5xh0000gn/T/ipykernel_43896/452425755.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/zk/lxc3sp7n5rqf4k_sl172k5xh0000gn/T/ipykernel_43896/452425755.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/zk/lxc3sp7n5rqf4k_sl172k5xh0000gn/T/ipykernel_43896/452425755.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)

There are no mixed data in orders.csv

In [42]:
#5 finding missing data
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [45]:
#creating dataframe of only missing vaules
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull()== True]

In [46]:
df_ords_nan

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,prior,1,4,12,NaN
3420934,3420934,3189322,206206,prior,1,3,18,NaN
3421002,3421002,2166133,206207,prior,1,6,19,NaN
3421019,3421019,2227043,206208,prior,1,1,15,NaN
3421069,3421069,3154581,206209,prior,1,3,11,NaN

In [48]:
#how many missing values are with order_number 1
df_ords_nan[df_ords_nan['order_number'] == 1]

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,prior,1,4,12,NaN
3420934,3420934,3189322,206206,prior,1,3,18,NaN
3421002,3421002,2166133,206207,prior,1,6,19,NaN
3421019,3421019,2227043,206208,prior,1,1,15,NaN
3421069,3421069,3154581,206209,prior,1,3,11,NaN

All missing data is assoicated with order_number 1, which means that it was the customer's first time purchasing and therefore they would not have a prior order. 

I am not not going to do anything with the missing data becuase this is accuract data as a first time customer would have missing data in the days_since_pior_order.

In [49]:
#7 checking duplicates
df_dups_ords = df_ords[df_ords.duplicated()]

In [50]:
df_dups_ords

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

No duplicates found

In [51]:
#exporting df_prods
df_ords.to_csv(os.path.join(path,'Data','Prepared Data','ords_checks.csv'))